tiborsimon/embedded-tdd-headers/pic/pic18/pic18f44k20_tdd.h
#define ECCP1AS                       522
#define PSSBD                         523
#define PSSBD0                        524
#define PSSBD1                        525
#define PSSAC                         526
#define PSSAC0                        527
#define PSSAC1                        528
#define ECCPAS0                       529
#define ECCPAS                        530
#define ECCPAS1                       531
#define ECCPAS2                       532
#define ECCPASE                       533
#define PWM1CON                       534
#define PDC0                          535
#define PDC                           536
#define PDC1                          537
#define PDC2                          538
#define PDC3                          539
#define PDC4                          540
#define PDC5                          541
#define PDC6                          542
#define PRSEN                         543
#define BAUDCON                       544
#define ABDEN                         545
#define W4E                           546
#define WUE                           547
#define BRG16                         548
#define SCKP                          549
#define CKTXP                         550
#define RXCKP                         551
#define DTRXP                         552
#define RCIDL                         553
#define ABDOVF                        554
#define PSTRCON                       555
#define STRA                          556
#define STRB                          557
#define STRC                          558
#define STRD                          559
#define STRSYNC                       560
#define CCP2CON                       561
#define CCP2M                         562
#define CCP2M0                        563
#define CCP2M1                        564
#define CCP2M2                        565
#define CCP2M3                        566
#define DC2B0                         567
#define DC2B                          568
#define DC2B1                         569
#define CCP1CON                       570
#define CCP1M0                        571
#define CCP1M                         572
#define CCP1M1                        573
#define CCP1M2                        574
#define CCP1M3                        575
#define DC1B                          576
#define DC1B0                         577
#define DC1B1                         578
#define P1M                           579
#define P1M0                          580
#define P1M1                          581
#define ADCON2                        582
#define ADCS0                         583
#define ADCS                          584
#define ADCS1                         585
#define ADCS2                         586
#define ACQT0                         587
#define ACQT                          588
#define ACQT1                         589
#define ACQT2                         590
#define ADFM                          591
#define ADCON1                        592
#define VCFG                          593
#define VCFG0                         594
#define VCFG01                        595
#define VCFG11                        596
#define VCFG1                         597
#define ADCON0                        598
#define ADON                          599
#define nDONE                         600
#define GO_nDONE                      601
#define NOT_DONE                      602
#define GODONE                        603
#define GO_DONE                       604
#define DONE                          605
#define GO_NOT_DONE                   606
#define GO                            607
#define CHS0                          608
#define CHS                           609
#define CHS1                          610
#define CHS2                          611
#define CHS3                          612
#define SSPCON2                       613
#define SEN                           614
#define RSEN                          615
#define PEN                           616
#define RCEN                          617
#define ACKEN                         618
#define ACKDT                         619
#define ACKSTAT                       620
#define GCEN                          621
#define SSPCON1                       622
#define SSPM0                         623
#define SSPM                          624
#define SSPM1                         625
#define SSPM2                         626
#define SSPM3                         627
#define CKP                           628
#define SSPEN                         629
#define SSPOV                         630
#define WCOL                          631
#define SSPSTAT                       632
#define BF                            633
#define UA                            634
#define R_NOT_W                       635
#define NOT_W                         636
#define nW                            637
#define RW                            638
#define nWRITE                        639
#define R                             640
#define W                             641
#define NOT_WRITE                     642
#define R_nW                          643
#define R_W                           644
#define START                         645
#define S                             646
#define STOP                          647
#define P                             648
#define A                             649
#define NOT_A                         650
#define nA                            651
#define D_A                           652
#define D_nA                          653
#define D                             654
#define DA                            655
#define D_NOT_A                       656
#define NOT_ADDRESS                   657
#define nADDRESS                      658
#define CKE                           659
#define SMP                           660
#define T2CON                         661
#define T2CKPS0                       662
#define T2CKPS                        663
#define T2CKPS1                       664
#define TMR2ON                        665
#define T2OUTPS0                      666
#define T2OUTPS                       667
#define T2OUTPS1                      668
#define T2OUTPS2                      669
#define T2OUTPS3                      670
#define PR2                           671
#define WM0                           672
#define WM1                           673
#define WAIT0                         674
#define WAIT1                         675
#define EBDIS                         676
#define T1CON                         677
#define TMR1ON                        678
#define TMR1CS                        679
#define NOT_T1SYNC                    680
#define T1SYNC                        681
#define nT1SYNC                       682
#define T1OSCEN                       683
#define SOSCEN                        684
#define T1CKPS0                       685
#define T1CKPS                        686
#define T1CKPS1                       687
#define T1RUN                         688
#define T1CON_RD16                    689
#define T1RD16                        690
#define RCON                          691
#define BOR                           692
#define NOT_BOR                       693
#define nBOR                          694
#define POR                           695
#define nPOR                          696
#define NOT_POR                       697
#define PD                            698
#define nPD                           699
#define NOT_PD                        700
#define NOT_TO                        701
#define nTO                           702
#define TO                            703
#define nRI                           704
#define NOT_RI                        705
#define RI                            706
#define SBOREN                        707
#define IPEN                          708
#define WDTCON                        709
#define SWDTE                         710
#define SWDTEN                        711
#define HLVDCON                       712
#define HLVDL                         713
#define HLVDL0                        714
#define LVV0                          715
#define LVDL0                         716
#define HLVDL1                        717
#define LVDL1                         718
#define LVV1                          719
#define HLVDL2                        720
#define LVV2                          721
#define LVDL2                         722
#define HLVDL3                        723
#define LVV3                          724
#define LVDL3                         725
#define HLVDEN                        726
#define LVDEN                         727
#define BGST                          728
#define IRVST                         729
#define IVRST                         730
#define VDIRMAG                       731
#define OSCCON                        732
#define SCS0                          733
#define SCS                           734
#define SCS1                          735
#define IOFS                          736
#define OSTS                          737
#define IRCF                          738
#define IRCF0                         739
#define IRCF1                         740
#define IRCF2                         741
#define IDLEN                         742
#define T0CON                         743
#define T0PS                          744
#define T0PS0                         745
#define T0PS1                         746
#define T0PS2                         747
#define PSA                           748
#define T0SE                          749
#define T0CS                          750
#define T08BIT                        751
#define TMR0ON                        752
#define STATUS                        753
#define C                             754
#define CARRY                         755
#define DC                            756
#define ZERO                          757
#define Z                             758
#define OV                            759
#define OVERFLOW                      760
#define N                             761
#define NEGATIVE                      762
#define INTCON3                       763
#define INT1IF                        764
#define INT1F                         765
#define INT2IF                        766
#define INT2F                         767
#define INT1E                         768
#define INT1IE                        769
#define INT2IE                        770
#define INT2E                         771
#define INT1P                         772
#define INT1IP                        773
#define INT2IP                        774
#define INT2P                         775
#define INTCON2                       776
#define RBIP                          777
#define TMR0IP                        778
#define INTEDG2                       779
#define INTEDG1                       780
#define INTEDG0                       781
#define RBPU                          782
#define NOT_RBPU                      783
#define nRBPU                         784
#define INTCON                        785
#define RBIF                          786
#define INT0F                         787
#define INT0IF                        788
#define T0IF                          789
#define TMR0IF                        790
#define RBIE                          791
#define INT0E                         792
#define INT0IE                        793
#define T0IE                          794
#define TMR0IE                        795
#define PEIE                          796
#define PEIE_GIEL                     797
#define GIEL                          798
#define GIE_GIEH                      799
#define GIE                           800
#define GIEH                          801
#define SP0                           802
#define STKPTR                        803
#define SP1                           804
#define SP2                           805
#define SP3                           806
#define SP4                           807
#define STKUNF                        808
#define STKOVF                        809
#define STKFUL                        810

#endif // _PIC18F44K20_H_
